Revit 2027 API
ParameterTypeId.PhyMaterialParamShearReinforcement Property
 "Shear reinforcement yield stress"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PhyMaterialParamShearReinforcement { get; }
Public Shared ReadOnly Property PhyMaterialParamShearReinforcement As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PhyMaterialParamShearReinforcement {
	ForgeTypeId^ get ();
}
static member PhyMaterialParamShearReinforcement : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace